
### :robot: Terraform Report
---
##### Plan: `2` to add, `0` to change, `1` to destroy

<details><summary>Show Plan</summary>

```terraform

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  - destroy

Terraform will perform the following actions:

  # helm_release.istio_gateway[0] will be destroyed
  # (because helm_release.istio_gateway is not in configuration)
  - resource "helm_release" "istio_gateway" {
      - atomic                     = false -> null
      - chart                      = "gateway" -> null
      - cleanup_on_fail            = false -> null
      - create_namespace           = false -> null
      - dependency_update          = false -> null
      - disable_crd_hooks          = false -> null
      - disable_openapi_validation = false -> null
      - disable_webhooks           = false -> null
      - force_update               = false -> null
      - id                         = "istio-gateway" -> null
      - lint                       = false -> null
      - max_history                = 0 -> null
      - metadata                   = [
          - {
              - app_version    = "1.23.2"
              - chart          = "gateway"
              - first_deployed = 1728903075
              - last_deployed  = 1728903075
              - name           = "istio-gateway"
              - namespace      = "istio-system"
              - notes          = <<-EOT
                    "istio-gateway" successfully installed!
                    
                    To learn more about the release, try:
                      $ helm status istio-gateway -n istio-system
                      $ helm get all istio-gateway -n istio-system
                    
                    Next steps:
                      * Deploy an HTTP Gateway: https://istio.io/latest/docs/tasks/traffic-management/ingress/ingress-control/
                      * Deploy an HTTPS Gateway: https://istio.io/latest/docs/tasks/traffic-management/ingress/secure-ingress/
                EOT
              - revision       = 1
              - values         = jsonencode({})
              - version        = "1.23.2"
            },
        ] -> null
      - name                       = "istio-gateway" -> null
      - namespace                  = "istio-system" -> null
      - pass_credentials           = false -> null
      - recreate_pods              = false -> null
      - render_subchart_notes      = true -> null
      - replace                    = false -> null
      - repository                 = "https://istio-release.storage.googleapis.com/charts" -> null
      - reset_values               = false -> null
      - reuse_values               = false -> null
      - skip_crds                  = false -> null
      - status                     = "deployed" -> null
      - timeout                    = 300 -> null
      - verify                     = false -> null
      - version                    = "1.23.2" -> null
      - wait                       = true -> null
      - wait_for_jobs              = false -> null
    }

  # helm_release.traefik[0] will be created
  + resource "helm_release" "traefik" {
      + atomic                     = false
      + chart                      = "traefik"
      + cleanup_on_fail            = false
      + create_namespace           = false
      + dependency_update          = false
      + disable_crd_hooks          = false
      + disable_openapi_validation = false
      + disable_webhooks           = false
      + force_update               = false
      + id                         = (known after apply)
      + lint                       = false
      + manifest                   = (known after apply)
      + max_history                = 0
      + metadata                   = (known after apply)
      + name                       = "traefik"
      + namespace                  = "traefik"
      + pass_credentials           = false
      + recreate_pods              = false
      + render_subchart_notes      = true
      + replace                    = false
      + repository                 = "https://traefik.github.io/charts"
      + reset_values               = false
      + reuse_values               = false
      + skip_crds                  = false
      + status                     = "deployed"
      + timeout                    = 300
      + values                     = [
          + <<-EOT
                globalArguments:
                  - "--global.sendanonymoususage=false"
                  - "--global.checknewversion=false"
                
                additionalArguments:
                  - "--serversTransport.insecureSkipVerify=true"
                  - "--log.level=INFO"
                
                deployment:
                  replicas: 3
                
                ports:
                  web:
                    redirectTo:
                      port: websecure
                  websecure:
                    tls:
                      enabled: true
                      
                ingressRoute:
                  dashboard:
                    enabled: false
                
                providers:
                  kubernetesCRD:
                    enabled: true
                  kubernetesIngress:
                    enabled: true
                    publishedService:
                      enabled: true
                
                service:
                  enabled: true
                  type: LoadBalancer
            EOT,
        ]
      + verify                     = false
      + version                    = "32.1.1"
      + wait                       = true
      + wait_for_jobs              = false

      + set {
          + name  = "ingressClass.name"
          + value = "traefik-external"
        }
    }

  # kubernetes_namespace.namespace-traefik will be created
  + resource "kubernetes_namespace" "namespace-traefik" {
      + id                               = (known after apply)
      + wait_for_default_service_account = false

      + metadata {
          + generation       = (known after apply)
          + name             = "traefik"
          + resource_version = (known after apply)
          + uid              = (known after apply)
        }
    }

Plan: 2 to add, 0 to change, 1 to destroy.

```
</details>


---
> This comment was generated by [Terraform Pull Request Report Generator](https://github.com/ahmadnassri/action-terraform-report) - action run [`#11489076888`](https://github.com/innovats-hub/system-apps-aks/actions/runs/11489076888) - commit 251738be81832dda023542a5fac8f45254f55bbb
